<a href="https://colab.research.google.com/github/shubham-dalmia/sds-tasks/blob/main/Pandas1.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [2]:
import numpy as np
import pandas as pd

In [10]:
df=pd.DataFrame({'Age': [10,20,30,40,50,60,70,80],
                 'Gender': ['Male', 'Male','Female','Female','Male','Male','Female','Female'],
                 'Height': [120,130,140,150,160,170,155,175],
                 'Weight': [40,45,50,55,60,65,70,75]}, columns=['Age','Gender','Height','Weight'])

In [14]:
df.index=['Aryan','Anurag','Chandan','Dilip','Falak','Shubham','Riya','Rakesh']

In [23]:
df

         Age  Gender  Height  Weight
Aryan     10    Male     120      40
Anurag    20    Male     130      45
Chandan   30  Female     140      50
Dilip     40  Female     150      55
Falak     50    Male     160      60
Shubham   60    Male     170      65
Riya      70  Female     155      70
Rakesh    80  Female     175      75

In [15]:
df.columns

Index(['Age', 'Gender', 'Height', 'Weight'], dtype='object')

In [16]:
df.index

Index(['Aryan', 'Anurag', 'Chandan', 'Dilip', 'Falak', 'Shubham', 'Riya',
       'Rakesh'],
      dtype='object')

In [17]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 8 entries, Aryan to Rakesh
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Age     8 non-null      int64
 1   Gender  8 non-null      object
 2   Height  8 non-null      int64
 3   Weight  8 non-null      int64
dtypes: int64(3), object(1)
memory usage: 640.0+ bytes

In [18]:
df.size

32

In [19]:
df.shape

(8, 4)

In [20]:
df.describe()

             Age     Height     Weight
count   8.000000    8.00000   8.000000
mean   45.000000  150.00000  57.500000
std    24.494897   19.08627  12.247449
min    10.000000  120.00000  40.000000
25%    27.500000  137.50000  48.750000
50%    45.000000  152.50000  57.500000
75%    62.500000  162.50000  66.250000
max    80.000000  175.00000  75.000000

In [21]:
df.dtypes

Age        int64
Gender    object
Height     int64
Weight     int64
dtype: object

In [22]:
df.dtypes.value_counts()

int64     3
object    1
dtype: int64

In [34]:
df['Age']

Aryan      10
Anurag     20
Chandan    30
Dilip      40
Falak      50
Shubham    60
Riya       70
Rakesh     80
Name: Age, dtype: int64

In [36]:
df['Age'].to_frame()

         Age
Aryan     10
Anurag    20
Chandan   30
Dilip     40
Falak     50
Shubham   60
Riya      70
Rakesh    80

In [38]:
df[['Age','Height']]

         Age  Height
Aryan     10     120
Anurag    20     130
Chandan   30     140
Dilip     40     150
Falak     50     160
Shubham   60     170
Riya      70     155
Rakesh    80     175

In [40]:
df[1:6]

         Age  Gender  Height  Weight
Anurag    20    Male     130      45
Chandan   30  Female     140      50
Dilip     40  Female     150      55
Falak     50    Male     160      60
Shubham   60    Male     170      65

In [41]:
df.loc['Shubham']

Age         60
Gender    Male
Height     170
Weight      65
Name: Shubham, dtype: object

In [42]:
df.loc['Anurag':'Falak']

         Age  Gender  Height  Weight
Anurag    20    Male     130      45
Chandan   30  Female     140      50
Dilip     40  Female     150      55
Falak     50    Male     160      60

In [43]:
df.loc['Chandan':'Shubham','Height']

Chandan    140
Dilip      150
Falak      160
Shubham    170
Name: Height, dtype: int64

In [44]:
df.loc['Chandan':'Riya',['Weight','Age']]

         Weight  Age
Chandan      50   30
Dilip        55   40
Falak        60   50
Shubham      65   60
Riya         70   70

In [45]:
df

         Age  Gender  Height  Weight
Aryan     10    Male     120      40
Anurag    20    Male     130      45
Chandan   30  Female     140      50
Dilip     40  Female     150      55
Falak     50    Male     160      60
Shubham   60    Male     170      65
Riya      70  Female     155      70
Rakesh    80  Female     175      75

In [46]:
df.iloc[3]

Age           40
Gender    Female
Height       150
Weight        55
Name: Dilip, dtype: object

In [47]:
df.iloc[-2]

Age           70
Gender    Female
Height       155
Weight        70
Name: Riya, dtype: object

In [52]:
df.iloc[0,3]

40

In [57]:
df.iloc[[1,2,3,-1]]

         Age  Gender  Height  Weight
Anurag    20    Male     130      45
Chandan   30  Female     140      50
Dilip     40  Female     150      55
Rakesh    80  Female     175      75

In [58]:
df.iloc[1:5]

         Age  Gender  Height  Weight
Anurag    20    Male     130      45
Chandan   30  Female     140      50
Dilip     40  Female     150      55
Falak     50    Male     160      60

In [60]:
df.iloc[1:6,2]

Anurag     130
Chandan    140
Dilip      150
Falak      160
Shubham    170
Name: Height, dtype: int64

In [62]:
df.iloc[1:5,[0,2]]

         Age  Height
Anurag    20     130
Chandan   30     140
Dilip     40     150
Falak     50     160

In [64]:
df.iloc[0:4,0:5]

         Age  Gender  Height  Weight
Aryan     10    Male     120      40
Anurag    20    Male     130      45
Chandan   30  Female     140      50
Dilip     40  Female     150      55

In [66]:
df['Age']>45

Aryan      False
Anurag     False
Chandan    False
Dilip      False
Falak       True
Shubham     True
Riya        True
Rakesh      True
Name: Age, dtype: bool

In [67]:
df.loc[df['Age']>45]

         Age  Gender  Height  Weight
Falak     50    Male     160      60
Shubham   60    Male     170      65
Riya      70  Female     155      70
Rakesh    80  Female     175      75

In [68]:
df.loc[df['Weight']>50,'Weight']

Dilip      55
Falak      60
Shubham    65
Riya       70
Rakesh     75
Name: Weight, dtype: int64

In [70]:
df.loc[df['Weight']>50,['Weight','Height','Age']]

         Weight  Height  Age
Dilip        55     150   40
Falak        60     160   50
Shubham      65     170   60
Riya         70     155   70
Rakesh       75     175   80

In [72]:
df.drop('Rakesh')

         Age  Gender  Height  Weight
Aryan     10    Male     120      40
Anurag    20    Male     130      45
Chandan   30  Female     140      50
Dilip     40  Female     150      55
Falak     50    Male     160      60
Shubham   60    Male     170      65
Riya      70  Female     155      70

In [73]:
df.drop(['Shubham','Riya'])

         Age  Gender  Height  Weight
Aryan     10    Male     120      40
Anurag    20    Male     130      45
Chandan   30  Female     140      50
Dilip     40  Female     150      55
Falak     50    Male     160      60
Rakesh    80  Female     175      75

In [74]:
df.drop(columns=['Age','Weight'])

         Gender  Height
Aryan      Male     120
Anurag     Male     130
Chandan  Female     140
Dilip    Female     150
Falak      Male     160
Shubham    Male     170
Riya     Female     155
Rakesh   Female     175

In [77]:
df.drop(['Aryan','Falak'],axis=0)

         Age  Gender  Height  Weight
Anurag    20    Male     130      45
Chandan   30  Female     140      50
Dilip     40  Female     150      55
Shubham   60    Male     170      65
Riya      70  Female     155      70
Rakesh    80  Female     175      75

In [79]:
df.drop(['Age'],axis=1)

         Gender  Height  Weight
Aryan      Male     120      40
Anurag     Male     130      45
Chandan  Female     140      50
Dilip    Female     150      55
Falak      Male     160      60
Shubham    Male     170      65
Riya     Female     155      70
Rakesh   Female     175      75

In [80]:
df.drop(['Weight'],axis='columns')

         Age  Gender  Height
Aryan     10    Male     120
Anurag    20    Male     130
Chandan   30  Female     140
Dilip     40  Female     150
Falak     50    Male     160
Shubham   60    Male     170
Riya      70  Female     155
Rakesh    80  Female     175

In [81]:
df.drop(['Aryan'],axis='rows')

         Age  Gender  Height  Weight
Anurag    20    Male     130      45
Chandan   30  Female     140      50
Dilip     40  Female     150      55
Falak     50    Male     160      60
Shubham   60    Male     170      65
Riya      70  Female     155      70
Rakesh    80  Female     175      75

In [82]:
df[['Age','Height']]

         Age  Height
Aryan     10     120
Anurag    20     130
Chandan   30     140
Dilip     40     150
Falak     50     160
Shubham   60     170
Riya      70     155
Rakesh    80     175

In [83]:
df[['Weight']]/10

         Weight
Aryan       4.0
Anurag      4.5
Chandan     5.0
Dilip       5.5
Falak       6.0
Shubham     6.5
Riya        7.0
Rakesh      7.5

In [88]:
changes=pd.Series([+100,-1],index=['Weight','Height'])

In [89]:
df[['Weight','Height']]+changes

         Weight  Height
Aryan       140     119
Anurag      145     129
Chandan     150     139
Dilip       155     149
Falak       160     159
Shubham     165     169
Riya        170     154
Rakesh      175     174

In [93]:
newcol=pd.Series(['Married','Unmarried','Married','Married','Unmarried','Unmarried','Unmarried','Married'],
                 index=['Aryan','Anurag','Chandan','Dilip','Falak','Shubham','Riya','Rakesh'],
                 name='Marital Status')

In [94]:
df['Marital Status']=newcol

In [95]:
df

         Age  Gender  Height  Weight Marital Status
Aryan     10    Male     120      40        Married
Anurag    20    Male     130      45      Unmarried
Chandan   30  Female     140      50        Married
Dilip     40  Female     150      55        Married
Falak     50    Male     160      60      Unmarried
Shubham   60    Male     170      65      Unmarried
Riya      70  Female     155      70      Unmarried
Rakesh    80  Female     175      75        Married

In [97]:
df.rename(columns={'Marital Status':'Marriage Status'},
          index={'Shubham':'Mohan'})

         Age  Gender  Height  Weight Marriage Status
Aryan     10    Male     120      40         Married
Anurag    20    Male     130      45       Unmarried
Chandan   30  Female     140      50         Married
Dilip     40  Female     150      55         Married
Falak     50    Male     160      60       Unmarried
Mohan     60    Male     170      65       Unmarried
Riya      70  Female     155      70       Unmarried
Rakesh    80  Female     175      75         Married

In [111]:
df.rename(str.upper)

         Age  Height  Weight Marital Status
ARYAN     10     120      40        Married
ANURAG    20     130      45      Unmarried
CHANDAN   30     140      50        Married
DILIP     40     150      55        Married
FALAK     50     160      60      Unmarried
SHUBHAM   60     170      65      Unmarried
RIYA      70     155      70      Unmarried
RAKESH    80     175      75        Married

In [108]:
df.rename(index=lambda x: x.lower())

         Age  Height  Weight Marital Status
aryan     10     120      40        Married
anurag    20     130      45      Unmarried
chandan   30     140      50        Married
dilip     40     150      55        Married
falak     50     160      60      Unmarried
shubham   60     170      65      Unmarried
riya      70     155      70      Unmarried
rakesh    80     175      75        Married

In [109]:
df

         Age  Height  Weight Marital Status
Aryan     10     120      40        Married
Anurag    20     130      45      Unmarried
Chandan   30     140      50        Married
Dilip     40     150      55        Married
Falak     50     160      60      Unmarried
Shubham   60     170      65      Unmarried
Riya      70     155      70      Unmarried
Rakesh    80     175      75        Married

In [117]:
df.append(pd.Series({'Age':56,'Weight':67},name='Vishal'))

          Age  Height  Weight Marital Status
Aryan    10.0   120.0    40.0        Married
Anurag   20.0   130.0    45.0      Unmarried
Chandan  30.0   140.0    50.0        Married
Dilip    40.0   150.0    55.0        Married
Falak    50.0   160.0    60.0      Unmarried
Shubham  60.0   170.0    65.0      Unmarried
Riya     70.0   155.0    70.0      Unmarried
Rakesh   80.0   175.0    75.0        Married
Vishal    NaN   160.0     NaN        Married
Vishal   56.0     NaN    67.0            NaN

In [118]:
df

          Age  Height  Weight Marital Status
Aryan    10.0     120    40.0        Married
Anurag   20.0     130    45.0      Unmarried
Chandan  30.0     140    50.0        Married
Dilip    40.0     150    55.0        Married
Falak    50.0     160    60.0      Unmarried
Shubham  60.0     170    65.0      Unmarried
Riya     70.0     155    70.0      Unmarried
Rakesh   80.0     175    75.0        Married
Vishal    NaN     160     NaN        Married

In [115]:
df.loc['Vishal']=pd.Series({'Height':160,'Marital Status':'Married'})

In [116]:
df

          Age  Height  Weight Marital Status
Aryan    10.0     120    40.0        Married
Anurag   20.0     130    45.0      Unmarried
Chandan  30.0     140    50.0        Married
Dilip    40.0     150    55.0        Married
Falak    50.0     160    60.0      Unmarried
Shubham  60.0     170    65.0      Unmarried
Riya     70.0     155    70.0      Unmarried
Rakesh   80.0     175    75.0        Married
Vishal    NaN     160     NaN        Married

In [120]:
df[['Weight','Height']]

         Weight  Height
Aryan      40.0     120
Anurag     45.0     130
Chandan    50.0     140
Dilip      55.0     150
Falak      60.0     160
Shubham    65.0     170
Riya       70.0     155
Rakesh     75.0     175
Vishal      NaN     160

In [124]:
df['Weight']/df['Height']/df['Height']/10000

Aryan      2.777778e-07
Anurag     2.662722e-07
Chandan    2.551020e-07
Dilip      2.444444e-07
Falak      2.343750e-07
Shubham    2.249135e-07
Riya       2.913632e-07
Rakesh     2.448980e-07
Vishal              NaN
dtype: float64

In [125]:
df['BMI']=df['Weight']/df['Height']/df['Height']/10000

In [126]:
df

          Age  Height  Weight Marital Status           BMI
Aryan    10.0     120    40.0        Married  2.777778e-07
Anurag   20.0     130    45.0      Unmarried  2.662722e-07
Chandan  30.0     140    50.0        Married  2.551020e-07
Dilip    40.0     150    55.0        Married  2.444444e-07
Falak    50.0     160    60.0      Unmarried  2.343750e-07
Shubham  60.0     170    65.0      Unmarried  2.249135e-07
Riya     70.0     155    70.0      Unmarried  2.913632e-07
Rakesh   80.0     175    75.0        Married  2.448980e-07
Vishal    NaN     160     NaN        Married           NaN

In [127]:
df.head()

          Age  Height  Weight Marital Status           BMI
Aryan    10.0     120    40.0        Married  2.777778e-07
Anurag   20.0     130    45.0      Unmarried  2.662722e-07
Chandan  30.0     140    50.0        Married  2.551020e-07
Dilip    40.0     150    55.0        Married  2.444444e-07
Falak    50.0     160    60.0      Unmarried  2.343750e-07

In [128]:
df.describe()

             Age      Height     Weight           BMI
count   8.000000    9.000000   8.000000  8.000000e+00
mean   45.000000  151.111111  57.500000  2.548933e-07
std    24.494897   18.162079  12.247449  2.239945e-08
min    10.000000  120.000000  40.000000  2.249135e-07
25%    27.500000  140.000000  48.750000  2.419271e-07
50%    45.000000  155.000000  57.500000  2.500000e-07
75%    62.500000  160.000000  66.250000  2.691486e-07
max    80.000000  175.000000  75.000000  2.913632e-07

In [129]:
Age=df['Age']

In [130]:
Age.min()

10.0

In [131]:
Age.max()

80.0

In [132]:
Age.sum()

360.0

In [134]:
Age.sum()/len(Age)

40.0

In [135]:
Age.mean()

45.0

In [137]:
Age.std()

24.49489742783178

In [138]:
Age.median()

45.0

In [139]:
Age.describe()

count     8.000000
mean     45.000000
std      24.494897
min      10.000000
25%      27.500000
50%      45.000000
75%      62.500000
max      80.000000
Name: Age, dtype: float64

In [143]:
Age.quantile([.30,.50,.80,1.0])

0.3    31.0
0.5    45.0
0.8    66.0
1.0    80.0
Name: Age, dtype: float64